## Terraform Plan (shared)

<details><summary>Show plan</summary>

```terraform
data.aws_vpc.default: Reading...
data.aws_vpc.default: Read complete after 1s [id=vpc-f169728a]
data.aws_route_tables.default: Reading...
data.aws_route_tables.default: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_account.main will be created
  + resource "aws_api_gateway_account" "main" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + region              = "us-east-1"
      + throttle_settings   = (known after apply)
    }

  # aws_iam_role.api_gateway_cloudwatch will be created
  + resource "aws_iam_role" "api_gateway_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "surfaced-art-us-east-1-api-gateway-cloudwatch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "surfaced-art-us-east-1-api-gateway-cloudwatch"
        }
      + tags_all              = {
          + "Layer"     = "shared"
          + "ManagedBy" = "terraform"
          + "Name"      = "surfaced-art-us-east-1-api-gateway-cloudwatch"
          + "Project"   = "surfaced-art"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.api_gateway_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "api_gateway_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "surfaced-art-us-east-1-api-gateway-cloudwatch"
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + region                = "us-east-1"
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-1831e767",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "surfaced-art-s3-endpoint"
        }
      + tags_all              = {
          + "Layer"     = "shared"
          + "ManagedBy" = "terraform"
          + "Name"      = "surfaced-art-s3-endpoint"
          + "Project"   = "surfaced-art"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-f169728a"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_cloudwatch_role_arn = (known after apply)
  + vpc_endpoint_s3_id              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Plan generated from commit 9e76a6e.